let start = confirm('Почнемо тест?');
if (start){
    var sum = 0;
    var a = confirm('2 + 2 = 4?');
    var b = +prompt('Скільки ніжок в сороканіжки?');
    var c = confirm('Це тест?');
    var d = confirm('Перша світова війна поxалася в 1913р?');
    var e = confirm('Згідно третього закону термодинаміки в замкненій системі ентропія може тільки зростати?');
    var f = +prompt('Запишіть число ПІ до 5 знаку після коми (включно).');
    var g = confirm('Тест продовжується?');
    var h = +prompt('Скільки букв в слові "Слово"?');
    var i = +prompt('Хвилі якої довжини переважно поглинаються хлорофілом "b" (нм)?');
    var j = +prompt('Це останнє завдання в тесті з 10 питань. Яке воно по рахунку?');
    
    if (a == true){
        sum++;
    }
    if (b == 40){
        sum++;
    }
    if (c == true){
        sum++;
    }
    if (d == false){
        sum++;
    }
    if (e == false){
        sum++;
    }
    if (f == 3.14159){
        sum++;
    }
    if (g == true){
        sum++;
    }
    if (h == 5){
        sum++;
    }
    if (i == 650){
        sum++;
    }
    if (j == 11){
        sum++;
    }
    
    switch (sum) {
        case 0:
            alert ("Ви набрали - 0 балів. Оцінка - Дуже невезучий");
            break;
        case 1:
            alert ("Ви набрали - 1 бал. Оцінка - Хоч щось");
            break;
        case 2:
            alert ("Ви набрали - 2 бали. Оцінка - Не розчаровуйся");
            break;
        case 3:
            alert ("Ви набрали - 3 бали. Оцінка - Прекрасно!");
            break;
        case 4:
            alert ("Ви набрали - 4 бали. Оцінка - Не надто вражає");
            break;
        case 5:
            alert ("Ви набрали - 5 балів. Оцінка - Не добре, але й не погано");
            break;
        case 6:
            alert ("Ви набрали - 6 балів. Оцінка - Більше половини. Молодець!");
            break;
        case 7:
            alert ("Ви набрали - 7 балів. Оцінка - Непогано");
            break;
        case 8:
            alert ("Ви набрали - 8 балів. Оцінка - Дуже непогано!");
            break;
        case 9:
            alert ("Ви набрали - 9 балів. Оцінка - Майже ідеально!");
            break;
        case 10:
            alert ("Ви набрали - 10 балів. Оцінка - Ідеально!");
            break;
    }
}
